Repository: common-repository/croppy-ai-assisted-image-cropper
Catalog: languages/croppy-ai-assisted-image-cropper-*.po
Languages: de_at

source: Email Address:
de_at: E-Mail-Adresse:

source: Application Password:
de_at: Applikationspasswort:

source: Configure
de_at: Konfigurieren

source: Logout
de_at: Ausloggen

source: Open Croppy
de_at: Croppy öffnen

source: This Plugin will help you to connect your WordPress Website with Croppy.
de_at: Dieses Plugin hilft Ihnen, Ihre WordPress-Website mit Croppy zu verbinden.

source: Steps you need to do before clicking finish:
de_at: Schritte, die Sie ausführen müssen, bevor Sie auf Fertig stellen klicken können:

source: Create a new user with the rights to create and manage media
de_at: Erstelle einen neuen Benutzer mit den Rechten zum Erstellen und Verwalten von Medien (Redakteur)

source: Create an application password for this user
de_at: Erstelle ein Applikationspasswort für diesen User

source: Copy the email address of the user and paste it into the form below
de_at: Kopiere die e-Mail dieses Users in das unten stehende Eingabefeld für die Mail unten

source: Copy the application password and paste it into the form below
de_at: Kopiere das Applikationspasswort in das unten stehende Eingabefeld für das Passwort

source: By clicking on finish it will do the following:
de_at: Bei Drücken von 'Konfigurieren' geschieht folgendes:

source: Create a new user on our systems with the user mail and password that you provided
de_at: Erstellt einen neuen Benutzer auf unserem System mit der Mail und dem Passwort, das du eingibst

source: Redirect you to the Croppy interface
de_at: Leitet dich auf die Croppy Seite weiter

source: Set you up to let you crop
de_at: Stellt alles fertig, um dich croppen zu lassen

source: Please do not modify the users password, as that is used to authenticate with the JSON RPC as a fallback method
de_at: Bitte ändern Sie nicht das Passwort des Benutzers, da dieses zur Authentifizierung mit der JSON RPC als Fallback-Methode verwendet wird

source: If you have any questions or need help, please reach out to us on
de_at: Bei etwaigen Fragen, kannst du uns gerne hier kontaktieren:

source: Issues with security related plugins
de_at: Bekannte Probleme mit Sicherheitsplugins

source: Please note that certain security-related plugins, such as WPSecurity or Remove XMLRPC Pingback Ping, may interfere with the functionality of this plugin. These plugins often disable or restrict the use of application passwords and the WordPress JSON-RPC API, which are essential for the proper operation of Croppy.
de_at: Bitte beachten Sie, dass bestimmte sicherheitsrelevante Plugins, wie z. B. 'WPSecurity' oder 'Remove XMLRPC Pingback Ping', die Funktionalität dieses Plugins beeinträchtigen können. Diese Plugins deaktivieren oder beschränken häufig die Verwendung von Anwendungskennwörtern und der WordPress JSON-RPC API, die für den ordnungsgemäßen Betrieb von Croppy unerlässlich sind.

source: To find out more, check out the
de_at: Um mehr herauszufinden, besuche die

source: or visit the download page of the plugin
de_at: oder besuche die Download-Seite unseres Plugins

source: WordPress documentation
de_at: WordPress Dokumentation

source: Successfully connected
de_at: Erfolgreich verbunden!

source: Everything went perfectly fine, to access your personal cropper, click the button below!
de_at: Alles wurde erfolgreich fertiggestellt, um deinen persönlichen Cropper zu erreichen, klicke auf 'Croppy öffnen'
